'''

████████╗██████╗░░█████╗░███████╗███████╗░██████╗██╗░░░██╗██╗░░██╗░█████╗░
╚══██╔══╝██╔══██╗██╔══██╗██╔════╝██╔════╝██╔════╝╚██╗░██╔╝██║░██╔╝██╔══██╗
░░░██║░░░██████╔╝███████║█████╗░░█████╗░░╚█████╗░░╚████╔╝░█████═╝░███████║
░░░██║░░░██╔══██╗██╔══██║██╔══╝░░██╔══╝░░░╚═══██╗░░╚██╔╝░░██╔═██╗░██╔══██║
░░░██║░░░██║░░██║██║░░██║██║░░░░░██║░░░░░██████╔╝░░░██║░░░██║░╚██╗██║░░██║
░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝


Все права на софт принадлежат админам сообщества TRAFFSYKA - t.me/Traffsyka
За слив софта - арбитраж на 3000 rub
'''
from random import randint, choice
from config import kilobyte
from time import sleep

print('████████╗██████╗░░█████╗░███████╗███████╗░██████╗██╗░░░██╗██╗░░██╗░█████╗░')
sleep(0.1)
print('╚══██╔══╝██╔══██╗██╔══██╗██╔════╝██╔════╝██╔════╝╚██╗░██╔╝██║░██╔╝██╔══██╗')
sleep(0.1)
print('░░░██║░░░██████╔╝███████║█████╗░░█████╗░░╚█████╗░░╚████╔╝░█████═╝░███████║')
sleep(0.1)
print('░░░██║░░░██╔══██╗██╔══██║██╔══╝░░██╔══╝░░░╚═══██╗░░╚██╔╝░░██╔═██╗░██╔══██║')
sleep(0.1)
print('░░░██║░░░██║░░██║██║░░██║██║░░░░░██║░░░░░██████╔╝░░░██║░░░██║░╚██╗██║░░██║')
sleep(0.1)
print('░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝░░░░░╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝')
print()
print()
sleep(0.1)
print('Все права на софт принадлежат админам сообщества TRAFFSYKA - t.me/Traffsyka')
print('За слив софта - арбитраж на 3000 rub')
print('Версия: 0.1')
print()
print()
print()
minsize = int(input('Введите минимальный размер файла: ')) # Минимальный размер файла в килобайтах
maxsize = int(input('Введите максимальный размер файла: ')) # Максимальный размер файла в килобайтах

filescount = int(input('Введите кол-во файлов: ')) # кол-во файлов для генерации

for i in range(0, filescount):

	with open(f'output/{i}.txt', encoding='utf8', mode='w') as f:
		colms = 8

		size = randint(minsize, maxsize)
		if size < 1:
			size = 1

		for i in range(0, size):
			for i in range(0, 26):
				count = 0
				stroke = ''
				while count < 8:
					stroke = stroke + choice(list('1234567890abcdefghigklmnopqrstuvyxwz')) + choice(list('1234567890abcdefghigklmnopqrstuvyxwz')) + choice(list('1234567890abcdefghigklmnopqrstuvyxwz')) + choice(list('1234567890abcdefghigklmnopqrstuvyxwz')) + ' '
					count += 1
				stroke = stroke + '\n'
				f.write(stroke)


print('[TS(FilesGen)] Файлы были успешно созданы! Файлы находятся в папке output')
input('Нажмите Enter для продолжения...')
